---
kind: property
id: P:Autodesk.Revit.DB.ColorOptions.SelectionSemitransparent
source: html/c9d5295e-0ba1-5421-cb09-82039ba73332.htm
---
# Autodesk.Revit.DB.ColorOptions.SelectionSemitransparent Property

Indicates whether or not selections will be shown in a semi-transparent manner in current canvas theme.

## Syntax (C#)
```csharp
public bool SelectionSemitransparent { get; set; }
```